// 1. Створіть умову, яка буде завжди виконуватися. В тілі умови виводьте повідомлення "Привіт!".

if (1) {
	console.log('Привіт');
}

/* 2. Подивіться на годинник і запишіть у змінну m кількість хвилин.
В залежності від цього значення виведіть в консоль одне з повідомленнь: */

let m = 10;

if (m < 30) {
	console.log('Перша половина години');
} else if (m >= 30) {
	console.log('Друга половина години');
} else {
	console.log('Введіть коректне значення');
}

// 3. В корзині n яблук. Виведіть повідомлення, якщо корзина буде порожньою:

let n = 0;

if (!n) {
	console.log('На жаль корзина порожня');
}

// 4. Тернарним оператором виведіть на екран одне з двох повідомлень:

console.log('Корзина ' + (n ? 'не ' : '') + 'порожня');

// 5. Виведіть на екран повідомлення, якщо в корзині від двох до п'яти яблук:

n = 4;
if (n >= 2 &&  n <= 5){
	console.log('В корзині декілька яблук');
}

// 6. Виведіть на екран повідомлення, якщо це правда:

n = 6;
if (n % 3 === 0  || n % 7 === 0) {
	console.log('Кількість яблук ділиться на 3 або на 7');
}