// 1. Створіть умову, яка буде завжди виконуватися. В тілі умови виводьте повідомлення "Привіт!".

let a = 10;

if (a > 0) {
	console.log('Привіт');
}


/* 2. Подивіться на годинник і запишіть у змінну m кількість хвилин.
В залежності від цього значення виведіть в консоль одне з повідомленнь: */

let m = 10;

if (m > 0 && m < 30) {
	console.log('Перша половина години');
} else if (m > 0 && m >= 30) {
	console.log('Друга половина години');
} else {
	console.log('Введіть коректне значення');
}


// 3. В корзині n яблук. Виведіть повідомлення, якщо корзина буде порожньою:

let n = 0;

if (n === 0 || n === '' || n === null || n === undefined) {
	console.log('На жаль корзина порожня');
}


// 4. Тернарним оператором виведіть на екран одне з двох повідомлень:

(n === 0 || n === '' || n === null || n === undefined) ? console.log('Корзина порожня') : console.log('Корзина не порожня');


// 5. Виведіть на екран повідомлення, якщо в корзині від двох до п'яти яблук:

n = 4;
if (n > 1 && n < 6) {
	console.log('В корзині декілька яблук');
}


// 6. Виведіть на екран повідомлення, якщо це правда:

n = 3;
if (n/3 || n/7) {
	console.log('Кількість яблук ділиться на 3 або на 7');
}