// 1. Створіть умову, яка буде завжди виконуватися. В тілі умови виводьте повідомлення "Привіт!".

let a = 10;

if (a > 0) {
	console.log('Привіт');
}


/* 2. Подивіться на годинник і запишіть у змінну m кількість хвилин.
В залежності від цього значення виведіть в консоль одне з повідомленнь: */

let m = 10;

if (m > 0 && m < 30) {
	console.log('Перша половина години');
} else if (m > 0 && m >= 30) {
	console.log('Друга половина години');
} else {
	console.log('Введіть коректне значення');
}


// 3. В корзині n яблук. Виведіть повідомлення, якщо корзина буде порожньою:

let n = 0;

if (!n) {
	console.log('На жаль корзина порожня');
}


// 4. Тернарним оператором виведіть на екран одне з двох повідомлень:
let message;
message = (!n) ? console.log('Корзина порожня') : console.log('Корзина не порожня');


// 5. Виведіть на екран повідомлення, якщо в корзині від двох до п'яти яблук:

n = 4;
switch (n) {
	case 2:
		console.log('В корзині декілька яблук');
		break;
	case 3:
		console.log('В корзині декілька яблук');
		break;
	case 4:
		console.log('В корзині декілька яблук');
		break;
	case 5:
		console.log('В корзині декілька яблук');
		break;
	default:
		console.log('Невідома кількість яблук');
		break;
}


// 6. Виведіть на екран повідомлення, якщо це правда:

n = 3;
if (n/3 || n/7) {
	console.log('Кількість яблук ділиться на 3 або на 7');
}